
var CityData = {
        "86": {
            "id": "86",
            "name": "中国",
            "hot": [
                {
                    'pid': 1,
                    'pname': '北京',
                    'id': 2,
                    'name': '北京市'
                },
                {
                    'pid': 21,
                    'pname': '上海',
                    'id': 22,
                    'name': '上海市'
                },
                {
                    'pid': 423,
                    'pname': '广东',
                    'id': 424,
                    'name': '广州市'
                },
                {
                    'pid': 423,
                    'pname': '广东',
                    'id': 524,
                    'name': '深圳市'
                },
                {
                    'pid': 1643,
                    'pname': '江苏',
                    'id': 1644,
                    'name': '南京市'
                }
            ],
            "province": [
                {
                    "id": "8600",
                    "name": "其他海外",
                    "city": []
                },
                {
                    "id": "8611",
                    "name": "北京",
                    "city": [
                        {
                            "id": "861101",
                            "name": "东城区"
                        },
                        {
                            "id": "861102",
                            "name": "西城区"
                        },
                        {
                            "id": "861103",
                            "name": "崇文区"
                        },
                        {
                            "id": "861104",
                            "name": "宣武区"
                        },
                        {
                            "id": "861105",
                            "name": "朝阳区"
                        },
                        {
                            "id": "861106",
                            "name": "丰台区"
                        },
                        {
                            "id": "861107",
                            "name": "石景山区"
                        },
                        {
                            "id": "861108",
                            "name": "海淀区"
                        },
                        {
                            "id": "861109",
                            "name": "门头沟区"
                        },
                        {
                            "id": "861111",
                            "name": "房山区"
                        },
                        {
                            "id": "861112",
                            "name": "通州区"
                        },
                        {
                            "id": "861113",
                            "name": "顺义区"
                        },
                        {
                            "id": "861114",
                            "name": "昌平区"
                        },
                        {
                            "id": "861115",
                            "name": "大兴区"
                        },
                        {
                            "id": "861116",
                            "name": "怀柔区"
                        },
                        {
                            "id": "861117",
                            "name": "平谷区"
                        },
                        {
                            "id": "861128",
                            "name": "密云县"
                        },
                        {
                            "id": "861129",
                            "name": "延庆县"
                        }
                    ]
                },
                {
                    "id": "8612",
                    "name": "天津",
                    "city": [
                        {
                            "id": "861201",
                            "name": "和平区"
                        },
                        {
                            "id": "861202",
                            "name": "河东区"
                        },
                        {
                            "id": "861203",
                            "name": "河西区"
                        },
                        {
                            "id": "861204",
                            "name": "南开区"
                        },
                        {
                            "id": "861205",
                            "name": "河北区"
                        },
                        {
                            "id": "861206",
                            "name": "红桥区"
                        },
                        {
                            "id": "861207",
                            "name": "塘沽区"
                        },
                        {
                            "id": "861208",
                            "name": "汉沽区"
                        },
                        {
                            "id": "861209",
                            "name": "大港区"
                        },
                        {
                            "id": "861210",
                            "name": "东丽区"
                        },
                        {
                            "id": "861211",
                            "name": "西青区"
                        },
                        {
                            "id": "861212",
                            "name": "津南区"
                        },
                        {
                            "id": "861213",
                            "name": "北辰区"
                        },
                        {
                            "id": "861214",
                            "name": "武清区"
                        },
                        {
                            "id": "861215",
                            "name": "宝坻区"
                        },
                        {
                            "id": "861221",
                            "name": "宁河县"
                        },
                        {
                            "id": "861223",
                            "name": "静海县"
                        },
                        {
                            "id": "861225",
                            "name": "蓟　县"
                        }
                    ]
                },
                {
                    "id": "8613",
                    "name": "河北省",
                    "city": [
                        {
                            "id": "861302",
                            "name": "唐山市"
                        },
                        {
                            "id": "861303",
                            "name": "秦皇岛市"
                        },
                        {
                            "id": "861304",
                            "name": "邯郸市"
                        },
                        {
                            "id": "861305",
                            "name": "邢台市"
                        },
                        {
                            "id": "861306",
                            "name": "保定市"
                        },
                        {
                            "id": "861307",
                            "name": "张家口市"
                        },
                        {
                            "id": "861308",
                            "name": "承德市"
                        },
                        {
                            "id": "861309",
                            "name": "沧州市"
                        },
                        {
                            "id": "861310",
                            "name": "廊坊市"
                        },
                        {
                            "id": "861311",
                            "name": "衡水市"
                        }
                    ]
                },
                {
                    "id": "8614",
                    "name": "山西省",
                    "city": [
                        {
                            "id": "861401",
                            "name": "太原市"
                        },
                        {
                            "id": "861402",
                            "name": "大同市"
                        },
                        {
                            "id": "861403",
                            "name": "阳泉市"
                        },
                        {
                            "id": "861404",
                            "name": "长治市"
                        },
                        {
                            "id": "861405",
                            "name": "晋城市"
                        },
                        {
                            "id": "861406",
                            "name": "朔州市"
                        },
                        {
                            "id": "861407",
                            "name": "晋中市"
                        },
                        {
                            "id": "861408",
                            "name": "运城市"
                        },
                        {
                            "id": "861409",
                            "name": "忻州市"
                        },
                        {
                            "id": "861410",
                            "name": "临汾市"
                        },
                        {
                            "id": "861411",
                            "name": "吕梁市"
                        }
                    ]
                },
                {
                    "id": "8615",
                    "name": "内蒙古",
                    "city": [
                        {
                            "id": "861501",
                            "name": "呼和浩特市"
                        },
                        {
                            "id": "861502",
                            "name": "包头市"
                        },
                        {
                            "id": "861503",
                            "name": "乌海市"
                        },
                        {
                            "id": "861504",
                            "name": "赤峰市"
                        },
                        {
                            "id": "861505",
                            "name": "通辽市"
                        },
                        {
                            "id": "861506",
                            "name": "鄂尔多斯市"
                        },
                        {
                            "id": "861507",
                            "name": "呼伦贝尔市"
                        },
                        {
                            "id": "861508",
                            "name": "巴彦淖尔市"
                        },
                        {
                            "id": "861509",
                            "name": "乌兰察布市"
                        },
                        {
                            "id": "861522",
                            "name": "兴安盟"
                        },
                        {
                            "id": "861525",
                            "name": "锡林郭勒盟"
                        },
                        {
                            "id": "861529",
                            "name": "阿拉善盟"
                        }
                    ]
                },
                {
                    "id": "8621",
                    "name": "辽宁省",
                    "city": [
                        {
                            "id": "862101",
                            "name": "沈阳市"
                        },
                        {
                            "id": "862102",
                            "name": "大连市"
                        },
                        {
                            "id": "862103",
                            "name": "鞍山市"
                        },
                        {
                            "id": "862104",
                            "name": "抚顺市"
                        },
                        {
                            "id": "862105",
                            "name": "本溪市"
                        },
                        {
                            "id": "862106",
                            "name": "丹东市"
                        },
                        {
                            "id": "862107",
                            "name": "锦州市"
                        },
                        {
                            "id": "862108",
                            "name": "营口市"
                        },
                        {
                            "id": "862109",
                            "name": "阜新市"
                        },
                        {
                            "id": "862110",
                            "name": "辽阳市"
                        },
                        {
                            "id": "862111",
                            "name": "盘锦市"
                        },
                        {
                            "id": "862112",
                            "name": "铁岭市"
                        },
                        {
                            "id": "862113",
                            "name": "朝阳市"
                        },
                        {
                            "id": "862114",
                            "name": "葫芦岛市"
                        }
                    ]
                },
                {
                    "id": "8622",
                    "name": "吉林省",
                    "city": [
                        {
                            "id": "862201",
                            "name": "长春市"
                        },
                        {
                            "id": "862202",
                            "name": "吉林市"
                        },
                        {
                            "id": "862203",
                            "name": "四平市"
                        },
                        {
                            "id": "862204",
                            "name": "辽源市"
                        },
                        {
                            "id": "862205",
                            "name": "通化市"
                        },
                        {
                            "id": "862206",
                            "name": "白山市"
                        },
                        {
                            "id": "862207",
                            "name": "松原市"
                        },
                        {
                            "id": "862208",
                            "name": "白城市"
                        },
                        {
                            "id": "862224",
                            "name": "延边朝鲜族自治州"
                        }
                    ]
                },
                {
                    "id": "8623",
                    "name": "黑龙江",
                    "city": [
                        {
                            "id": "862301",
                            "name": "哈尔滨市"
                        },
                        {
                            "id": "862302",
                            "name": "齐齐哈尔市"
                        },
                        {
                            "id": "862303",
                            "name": "鸡西市"
                        },
                        {
                            "id": "862304",
                            "name": "鹤岗市"
                        },
                        {
                            "id": "862305",
                            "name": "双鸭山市"
                        },
                        {
                            "id": "862306",
                            "name": "大庆市"
                        },
                        {
                            "id": "862307",
                            "name": "伊春市"
                        },
                        {
                            "id": "862308",
                            "name": "佳木斯市"
                        },
                        {
                            "id": "862309",
                            "name": "七台河市"
                        },
                        {
                            "id": "862310",
                            "name": "牡丹江市"
                        },
                        {
                            "id": "862311",
                            "name": "黑河市"
                        },
                        {
                            "id": "862312",
                            "name": "绥化市"
                        },
                        {
                            "id": "862327",
                            "name": "大兴安岭地区"
                        }
                    ]
                },
                {
                    "id": "8631",
                    "name": "上海市",
                    "city": [
                        {
                            "id": "863101",
                            "name": "黄浦区"
                        },
                        {
                            "id": "863103",
                            "name": "卢湾区"
                        },
                        {
                            "id": "863104",
                            "name": "徐汇区"
                        },
                        {
                            "id": "863105",
                            "name": "长宁区"
                        },
                        {
                            "id": "863106",
                            "name": "静安区"
                        },
                        {
                            "id": "863107",
                            "name": "普陀区"
                        },
                        {
                            "id": "863108",
                            "name": "闸北区"
                        },
                        {
                            "id": "863109",
                            "name": "虹口区"
                        },
                        {
                            "id": "863110",
                            "name": "杨浦区"
                        },
                        {
                            "id": "863112",
                            "name": "闵行区"
                        },
                        {
                            "id": "863113",
                            "name": "宝山区"
                        },
                        {
                            "id": "863114",
                            "name": "嘉定区"
                        },
                        {
                            "id": "863115",
                            "name": "浦东新区"
                        },
                        {
                            "id": "863116",
                            "name": "金山区"
                        },
                        {
                            "id": "863117",
                            "name": "松江区"
                        },
                        {
                            "id": "863118",
                            "name": "青浦区"
                        },
                        {
                            "id": "863119",
                            "name": "南汇区"
                        },
                        {
                            "id": "863120",
                            "name": "奉贤区"
                        },
                        {
                            "id": "863130",
                            "name": "崇明县"
                        }
                    ]
                },
                {
                    "id": "8632",
                    "name": "江苏省",
                    "city": [
                        {
                            "id": "863201",
                            "name": "南京市"
                        },
                        {
                            "id": "863202",
                            "name": "无锡市"
                        },
                        {
                            "id": "863203",
                            "name": "徐州市"
                        },
                        {
                            "id": "863204",
                            "name": "常州市"
                        },
                        {
                            "id": "863205",
                            "name": "苏州市"
                        },
                        {
                            "id": "863206",
                            "name": "南通市"
                        },
                        {
                            "id": "863207",
                            "name": "连云港市"
                        },
                        {
                            "id": "863208",
                            "name": "淮安市"
                        },
                        {
                            "id": "863209",
                            "name": "盐城市"
                        },
                        {
                            "id": "863210",
                            "name": "扬州市"
                        },
                        {
                            "id": "863211",
                            "name": "镇江市"
                        },
                        {
                            "id": "863212",
                            "name": "泰州市"
                        },
                        {
                            "id": "863213",
                            "name": "宿迁市"
                        }
                    ]
                },
                {
                    "id": "8633",
                    "name": "浙江省",
                    "city": [
                        {
                            "id": "863301",
                            "name": "杭州市"
                        },
                        {
                            "id": "863302",
                            "name": "宁波市"
                        },
                        {
                            "id": "863303",
                            "name": "温州市"
                        },
                        {
                            "id": "863304",
                            "name": "嘉兴市"
                        },
                        {
                            "id": "863305",
                            "name": "湖州市"
                        },
                        {
                            "id": "863306",
                            "name": "绍兴市"
                        },
                        {
                            "id": "863307",
                            "name": "金华市"
                        },
                        {
                            "id": "863308",
                            "name": "衢州市"
                        },
                        {
                            "id": "863309",
                            "name": "舟山市"
                        },
                        {
                            "id": "863310",
                            "name": "台州市"
                        },
                        {
                            "id": "863311",
                            "name": "丽水市"
                        }
                    ]
                },
                {
                    "id": "8634",
                    "name": "安徽省",
                    "city": [
                        {
                            "id": "863401",
                            "name": "合肥市"
                        },
                        {
                            "id": "863402",
                            "name": "芜湖市"
                        },
                        {
                            "id": "863403",
                            "name": "蚌埠市"
                        },
                        {
                            "id": "863404",
                            "name": "淮南市"
                        },
                        {
                            "id": "863405",
                            "name": "马鞍山市"
                        },
                        {
                            "id": "863406",
                            "name": "淮北市"
                        },
                        {
                            "id": "863407",
                            "name": "铜陵市"
                        },
                        {
                            "id": "863408",
                            "name": "安庆市"
                        },
                        {
                            "id": "863410",
                            "name": "黄山市"
                        },
                        {
                            "id": "863411",
                            "name": "滁州市"
                        },
                        {
                            "id": "863412",
                            "name": "阜阳市"
                        },
                        {
                            "id": "863413",
                            "name": "宿州市"
                        },
                        {
                            "id": "863414",
                            "name": "巢湖市"
                        },
                        {
                            "id": "863415",
                            "name": "六安市"
                        },
                        {
                            "id": "863416",
                            "name": "亳州市"
                        },
                        {
                            "id": "863417",
                            "name": "池州市"
                        },
                        {
                            "id": "863418",
                            "name": "宣城市"
                        }
                    ]
                },
                {
                    "id": "8635",
                    "name": "福建省",
                    "city": [
                        {
                            "id": "863501",
                            "name": "福州市"
                        },
                        {
                            "id": "863502",
                            "name": "厦门市"
                        },
                        {
                            "id": "863503",
                            "name": "莆田市"
                        },
                        {
                            "id": "863504",
                            "name": "三明市"
                        },
                        {
                            "id": "863505",
                            "name": "泉州市"
                        },
                        {
                            "id": "863506",
                            "name": "漳州市"
                        },
                        {
                            "id": "863507",
                            "name": "南平市"
                        },
                        {
                            "id": "863508",
                            "name": "龙岩市"
                        },
                        {
                            "id": "863509",
                            "name": "宁德市"
                        }
                    ]
                },
                {
                    "id": "8636",
                    "name": "江西省",
                    "city": [
                        {
                            "id": "863601",
                            "name": "南昌市"
                        },
                        {
                            "id": "863602",
                            "name": "景德镇市"
                        },
                        {
                            "id": "863603",
                            "name": "萍乡市"
                        },
                        {
                            "id": "863604",
                            "name": "九江市"
                        },
                        {
                            "id": "863605",
                            "name": "新余市"
                        },
                        {
                            "id": "863606",
                            "name": "鹰潭市"
                        },
                        {
                            "id": "863607",
                            "name": "赣州市"
                        },
                        {
                            "id": "863608",
                            "name": "吉安市"
                        },
                        {
                            "id": "863609",
                            "name": "宜春市"
                        },
                        {
                            "id": "863610",
                            "name": "抚州市"
                        },
                        {
                            "id": "863611",
                            "name": "上饶市"
                        }
                    ]
                },
                {
                    "id": "8637",
                    "name": "山东省",
                    "city": [
                        {
                            "id": "863701",
                            "name": "济南市"
                        },
                        {
                            "id": "863702",
                            "name": "青岛市"
                        },
                        {
                            "id": "863703",
                            "name": "淄博市"
                        },
                        {
                            "id": "863704",
                            "name": "枣庄市"
                        },
                        {
                            "id": "863705",
                            "name": "东营市"
                        },
                        {
                            "id": "863706",
                            "name": "烟台市"
                        },
                        {
                            "id": "863707",
                            "name": "潍坊市"
                        },
                        {
                            "id": "863708",
                            "name": "济宁市"
                        },
                        {
                            "id": "863709",
                            "name": "泰安市"
                        },
                        {
                            "id": "863710",
                            "name": "威海市"
                        },
                        {
                            "id": "863711",
                            "name": "日照市"
                        },
                        {
                            "id": "863712",
                            "name": "莱芜市"
                        },
                        {
                            "id": "863713",
                            "name": "临沂市"
                        },
                        {
                            "id": "863714",
                            "name": "德州市"
                        },
                        {
                            "id": "863715",
                            "name": "聊城市"
                        },
                        {
                            "id": "863716",
                            "name": "滨州市"
                        },
                        {
                            "id": "863717",
                            "name": "荷泽市"
                        }
                    ]
                },
                {
                    "id": "8641",
                    "name": "河南省",
                    "city": [
                        {
                            "id": "864101",
                            "name": "郑州市"
                        },
                        {
                            "id": "864102",
                            "name": "开封市"
                        },
                        {
                            "id": "864103",
                            "name": "洛阳市"
                        },
                        {
                            "id": "864104",
                            "name": "平顶山市"
                        },
                        {
                            "id": "864105",
                            "name": "安阳市"
                        },
                        {
                            "id": "864106",
                            "name": "鹤壁市"
                        },
                        {
                            "id": "864107",
                            "name": "新乡市"
                        },
                        {
                            "id": "864108",
                            "name": "焦作市"
                        },
                        {
                            "id": "864109",
                            "name": "濮阳市"
                        },
                        {
                            "id": "864110",
                            "name": "许昌市"
                        },
                        {
                            "id": "864111",
                            "name": "漯河市"
                        },
                        {
                            "id": "864112",
                            "name": "三门峡市"
                        },
                        {
                            "id": "864113",
                            "name": "南阳市"
                        },
                        {
                            "id": "864114",
                            "name": "商丘市"
                        },
                        {
                            "id": "864115",
                            "name": "信阳市"
                        },
                        {
                            "id": "864116",
                            "name": "周口市"
                        },
                        {
                            "id": "864117",
                            "name": "驻马店市"
                        }
                    ]
                },
                {
                    "id": "8642",
                    "name": "湖北省",
                    "city": [
                        {
                            "id": "864201",
                            "name": "武汉市"
                        },
                        {
                            "id": "864202",
                            "name": "黄石市"
                        },
                        {
                            "id": "864203",
                            "name": "十堰市"
                        },
                        {
                            "id": "864205",
                            "name": "宜昌市"
                        },
                        {
                            "id": "864206",
                            "name": "襄樊市"
                        },
                        {
                            "id": "864207",
                            "name": "鄂州市"
                        },
                        {
                            "id": "864208",
                            "name": "荆门市"
                        },
                        {
                            "id": "864209",
                            "name": "孝感市"
                        },
                        {
                            "id": "864210",
                            "name": "荆州市"
                        },
                        {
                            "id": "864211",
                            "name": "黄冈市"
                        },
                        {
                            "id": "864212",
                            "name": "咸宁市"
                        },
                        {
                            "id": "864213",
                            "name": "随州市"
                        },
                        {
                            "id": "864228",
                            "name": "恩施土家族苗族自治州"
                        },
                        {
                            "id": "864290",
                            "name": "省直辖行政单位"
                        }
                    ]
                },
                {
                    "id": "8643",
                    "name": "湖南省",
                    "city": [
                        {
                            "id": "864301",
                            "name": "长沙市"
                        },
                        {
                            "id": "864302",
                            "name": "株洲市"
                        },
                        {
                            "id": "864303",
                            "name": "湘潭市"
                        },
                        {
                            "id": "864304",
                            "name": "衡阳市"
                        },
                        {
                            "id": "864305",
                            "name": "邵阳市"
                        },
                        {
                            "id": "864306",
                            "name": "岳阳市"
                        },
                        {
                            "id": "864307",
                            "name": "常德市"
                        },
                        {
                            "id": "864308",
                            "name": "张家界市"
                        },
                        {
                            "id": "864309",
                            "name": "益阳市"
                        },
                        {
                            "id": "864310",
                            "name": "郴州市"
                        },
                        {
                            "id": "864311",
                            "name": "永州市"
                        },
                        {
                            "id": "864312",
                            "name": "怀化市"
                        },
                        {
                            "id": "864313",
                            "name": "娄底市"
                        },
                        {
                            "id": "864331",
                            "name": "湘西土家族苗族自治州"
                        }
                    ]
                },
                {
                    "id": "8644",
                    "name": "广东省",
                    "city": [
                        {
                            "id": "864401",
                            "name": "广州市"
                        },
                        {
                            "id": "864402",
                            "name": "韶关市"
                        },
                        {
                            "id": "864403",
                            "name": "深圳市"
                        },
                        {
                            "id": "864404",
                            "name": "珠海市"
                        },
                        {
                            "id": "864405",
                            "name": "汕头市"
                        },
                        {
                            "id": "864406",
                            "name": "佛山市"
                        },
                        {
                            "id": "864407",
                            "name": "江门市"
                        },
                        {
                            "id": "864408",
                            "name": "湛江市"
                        },
                        {
                            "id": "864409",
                            "name": "茂名市"
                        },
                        {
                            "id": "864412",
                            "name": "肇庆市"
                        },
                        {
                            "id": "864413",
                            "name": "惠州市"
                        },
                        {
                            "id": "864414",
                            "name": "梅州市"
                        },
                        {
                            "id": "864415",
                            "name": "汕尾市"
                        },
                        {
                            "id": "864416",
                            "name": "河源市"
                        },
                        {
                            "id": "864417",
                            "name": "阳江市"
                        },
                        {
                            "id": "864418",
                            "name": "清远市"
                        },
                        {
                            "id": "864419",
                            "name": "东莞市"
                        },
                        {
                            "id": "864420",
                            "name": "中山市"
                        },
                        {
                            "id": "864451",
                            "name": "潮州市"
                        },
                        {
                            "id": "864452",
                            "name": "揭阳市"
                        },
                        {
                            "id": "864453",
                            "name": "云浮市"
                        }
                    ]
                },
                {
                    "id": "8645",
                    "name": "广西省",
                    "city": [
                        {
                            "id": "864501",
                            "name": "南宁市"
                        },
                        {
                            "id": "864502",
                            "name": "柳州市"
                        },
                        {
                            "id": "864503",
                            "name": "桂林市"
                        },
                        {
                            "id": "864504",
                            "name": "梧州市"
                        },
                        {
                            "id": "864505",
                            "name": "北海市"
                        },
                        {
                            "id": "864506",
                            "name": "防城港市"
                        },
                        {
                            "id": "864507",
                            "name": "钦州市"
                        },
                        {
                            "id": "864508",
                            "name": "贵港市"
                        },
                        {
                            "id": "864509",
                            "name": "玉林市"
                        },
                        {
                            "id": "864510",
                            "name": "百色市"
                        },
                        {
                            "id": "864511",
                            "name": "贺州市"
                        },
                        {
                            "id": "864512",
                            "name": "河池市"
                        },
                        {
                            "id": "864513",
                            "name": "来宾市"
                        },
                        {
                            "id": "864514",
                            "name": "崇左市"
                        }
                    ]
                },
                {
                    "id": "8646",
                    "name": "海南省",
                    "city": [
                        {
                            "id": "864601",
                            "name": "海口市"
                        },
                        {
                            "id": "864602",
                            "name": "三亚市"
                        },
                        {
                            "id": "864690",
                            "name": "省直辖县级行政单位"
                        }
                    ]
                },
                {
                    "id": "8650",
                    "name": "重庆市",
                    "city": [
                        {
                            "id": "865001",
                            "name": "万州区"
                        },
                        {
                            "id": "865002",
                            "name": "涪陵区"
                        },
                        {
                            "id": "865003",
                            "name": "渝中区"
                        },
                        {
                            "id": "865004",
                            "name": "大渡口区"
                        },
                        {
                            "id": "865005",
                            "name": "江北区"
                        },
                        {
                            "id": "865006",
                            "name": "沙坪坝区"
                        },
                        {
                            "id": "865007",
                            "name": "九龙坡区"
                        },
                        {
                            "id": "865008",
                            "name": "南岸区"
                        },
                        {
                            "id": "865009",
                            "name": "北碚区"
                        },
                        {
                            "id": "865010",
                            "name": "万盛区"
                        },
                        {
                            "id": "865011",
                            "name": "双桥区"
                        },
                        {
                            "id": "865012",
                            "name": "渝北区"
                        },
                        {
                            "id": "865013",
                            "name": "巴南区"
                        },
                        {
                            "id": "865014",
                            "name": "黔江区"
                        },
                        {
                            "id": "865015",
                            "name": "长寿区"
                        },
                        {
                            "id": "865022",
                            "name": "綦江县"
                        },
                        {
                            "id": "865023",
                            "name": "潼南县"
                        },
                        {
                            "id": "865024",
                            "name": "铜梁县"
                        },
                        {
                            "id": "865025",
                            "name": "大足县"
                        },
                        {
                            "id": "865026",
                            "name": "荣昌县"
                        },
                        {
                            "id": "865027",
                            "name": "璧山县"
                        },
                        {
                            "id": "865028",
                            "name": "梁平县"
                        },
                        {
                            "id": "865029",
                            "name": "城口县"
                        },
                        {
                            "id": "865030",
                            "name": "丰都县"
                        },
                        {
                            "id": "865031",
                            "name": "垫江县"
                        },
                        {
                            "id": "865032",
                            "name": "武隆县"
                        },
                        {
                            "id": "865033",
                            "name": "忠　县"
                        },
                        {
                            "id": "865034",
                            "name": "开　县"
                        },
                        {
                            "id": "865035",
                            "name": "云阳县"
                        },
                        {
                            "id": "865036",
                            "name": "奉节县"
                        },
                        {
                            "id": "865037",
                            "name": "巫山县"
                        },
                        {
                            "id": "865038",
                            "name": "巫溪县"
                        },
                        {
                            "id": "865040",
                            "name": "石柱土家族自治县"
                        },
                        {
                            "id": "865041",
                            "name": "秀山土家族苗族自治县"
                        },
                        {
                            "id": "865042",
                            "name": "酉阳土家族苗族自治县"
                        },
                        {
                            "id": "865043",
                            "name": "彭水苗族土家族自治县"
                        },
                        {
                            "id": "865081",
                            "name": "江津市"
                        },
                        {
                            "id": "865082",
                            "name": "合川市"
                        },
                        {
                            "id": "865083",
                            "name": "永川市"
                        },
                        {
                            "id": "865084",
                            "name": "南川市"
                        }
                    ]
                },
                {
                    "id": "8651",
                    "name": "四川省",
                    "city": [
                        {
                            "id": "865101",
                            "name": "成都市"
                        },
                        {
                            "id": "865103",
                            "name": "自贡市"
                        },
                        {
                            "id": "865104",
                            "name": "攀枝花市"
                        },
                        {
                            "id": "865105",
                            "name": "泸州市"
                        },
                        {
                            "id": "865106",
                            "name": "德阳市"
                        },
                        {
                            "id": "865107",
                            "name": "绵阳市"
                        },
                        {
                            "id": "865108",
                            "name": "广元市"
                        },
                        {
                            "id": "865109",
                            "name": "遂宁市"
                        },
                        {
                            "id": "865110",
                            "name": "内江市"
                        },
                        {
                            "id": "865111",
                            "name": "乐山市"
                        },
                        {
                            "id": "865113",
                            "name": "南充市"
                        },
                        {
                            "id": "865114",
                            "name": "眉山市"
                        },
                        {
                            "id": "865115",
                            "name": "宜宾市"
                        },
                        {
                            "id": "865116",
                            "name": "广安市"
                        },
                        {
                            "id": "865117",
                            "name": "达州市"
                        },
                        {
                            "id": "865118",
                            "name": "雅安市"
                        },
                        {
                            "id": "865119",
                            "name": "巴中市"
                        },
                        {
                            "id": "865120",
                            "name": "资阳市"
                        },
                        {
                            "id": "865132",
                            "name": "阿坝藏族羌族自治州"
                        },
                        {
                            "id": "865133",
                            "name": "甘孜藏族自治州"
                        },
                        {
                            "id": "865134",
                            "name": "凉山彝族自治州"
                        }
                    ]
                },
                {
                    "id": "8652",
                    "name": "贵州省",
                    "city": [
                        {
                            "id": "865201",
                            "name": "贵阳市"
                        },
                        {
                            "id": "865202",
                            "name": "六盘水市"
                        },
                        {
                            "id": "865203",
                            "name": "遵义市"
                        },
                        {
                            "id": "865204",
                            "name": "安顺市"
                        },
                        {
                            "id": "865222",
                            "name": "铜仁地区"
                        },
                        {
                            "id": "865223",
                            "name": "黔西南布依族苗族自治州"
                        },
                        {
                            "id": "865224",
                            "name": "毕节地区"
                        },
                        {
                            "id": "865226",
                            "name": "黔东南苗族侗族自治州"
                        },
                        {
                            "id": "865227",
                            "name": "黔南布依族苗族自治州"
                        }
                    ]
                },
                {
                    "id": "8653",
                    "name": "云南省",
                    "city": [
                        {
                            "id": "865301",
                            "name": "昆明市"
                        },
                        {
                            "id": "865303",
                            "name": "曲靖市"
                        },
                        {
                            "id": "865304",
                            "name": "玉溪市"
                        },
                        {
                            "id": "865305",
                            "name": "保山市"
                        },
                        {
                            "id": "865306",
                            "name": "昭通市"
                        },
                        {
                            "id": "865307",
                            "name": "丽江市"
                        },
                        {
                            "id": "865308",
                            "name": "思茅市"
                        },
                        {
                            "id": "865309",
                            "name": "临沧市"
                        },
                        {
                            "id": "865323",
                            "name": "楚雄彝族自治州"
                        },
                        {
                            "id": "865325",
                            "name": "红河哈尼族彝族自治州"
                        },
                        {
                            "id": "865326",
                            "name": "文山壮族苗族自治州"
                        },
                        {
                            "id": "865328",
                            "name": "西双版纳傣族自治州"
                        },
                        {
                            "id": "865329",
                            "name": "大理白族自治州"
                        },
                        {
                            "id": "865331",
                            "name": "德宏傣族景颇族自治州"
                        },
                        {
                            "id": "865333",
                            "name": "怒江傈僳族自治州"
                        },
                        {
                            "id": "865334",
                            "name": "迪庆藏族自治州"
                        }
                    ]
                },
                {
                    "id": "8654",
                    "name": "西   藏",
                    "city": [
                        {
                            "id": "865401",
                            "name": "拉萨市"
                        },
                        {
                            "id": "865421",
                            "name": "昌都地区"
                        },
                        {
                            "id": "865422",
                            "name": "山南地区"
                        },
                        {
                            "id": "865423",
                            "name": "日喀则地区"
                        },
                        {
                            "id": "865424",
                            "name": "那曲地区"
                        },
                        {
                            "id": "865425",
                            "name": "阿里地区"
                        },
                        {
                            "id": "865426",
                            "name": "林芝地区"
                        }
                    ]
                },
                {
                    "id": "8661",
                    "name": "陕西省",
                    "city": [
                        {
                            "id": "866101",
                            "name": "西安市"
                        },
                        {
                            "id": "866102",
                            "name": "铜川市"
                        },
                        {
                            "id": "866103",
                            "name": "宝鸡市"
                        },
                        {
                            "id": "866104",
                            "name": "咸阳市"
                        },
                        {
                            "id": "866105",
                            "name": "渭南市"
                        },
                        {
                            "id": "866106",
                            "name": "延安市"
                        },
                        {
                            "id": "866107",
                            "name": "汉中市"
                        },
                        {
                            "id": "866108",
                            "name": "榆林市"
                        },
                        {
                            "id": "866109",
                            "name": "安康市"
                        },
                        {
                            "id": "866110",
                            "name": "商洛市"
                        }
                    ]
                },
                {
                    "id": "8662",
                    "name": "甘肃省",
                    "city": [
                        {
                            "id": "866201",
                            "name": "兰州市"
                        },
                        {
                            "id": "866202",
                            "name": "嘉峪关市"
                        },
                        {
                            "id": "866203",
                            "name": "金昌市"
                        },
                        {
                            "id": "866204",
                            "name": "白银市"
                        },
                        {
                            "id": "866205",
                            "name": "天水市"
                        },
                        {
                            "id": "866206",
                            "name": "武威市"
                        },
                        {
                            "id": "866207",
                            "name": "张掖市"
                        },
                        {
                            "id": "866208",
                            "name": "平凉市"
                        },
                        {
                            "id": "866209",
                            "name": "酒泉市"
                        },
                        {
                            "id": "866210",
                            "name": "庆阳市"
                        },
                        {
                            "id": "866211",
                            "name": "定西市"
                        },
                        {
                            "id": "866212",
                            "name": "陇南市"
                        },
                        {
                            "id": "866229",
                            "name": "临夏回族自治州"
                        },
                        {
                            "id": "866230",
                            "name": "甘南藏族自治州"
                        }
                    ]
                },
                {
                    "id": "8663",
                    "name": "青海省",
                    "city": [
                        {
                            "id": "866301",
                            "name": "西宁市"
                        },
                        {
                            "id": "866321",
                            "name": "海东地区"
                        },
                        {
                            "id": "866322",
                            "name": "海北藏族自治州"
                        },
                        {
                            "id": "866323",
                            "name": "黄南藏族自治州"
                        },
                        {
                            "id": "866325",
                            "name": "海南藏族自治州"
                        },
                        {
                            "id": "866326",
                            "name": "果洛藏族自治州"
                        },
                        {
                            "id": "866327",
                            "name": "玉树藏族自治州"
                        },
                        {
                            "id": "866328",
                            "name": "海西蒙古族藏族自治州"
                        }
                    ]
                },
                {
                    "id": "8664",
                    "name": "宁夏省",
                    "city": [
                        {
                            "id": "866401",
                            "name": "银川市"
                        },
                        {
                            "id": "866402",
                            "name": "石嘴山市"
                        },
                        {
                            "id": "866403",
                            "name": "吴忠市"
                        },
                        {
                            "id": "866404",
                            "name": "固原市"
                        },
                        {
                            "id": "866405",
                            "name": "中卫市"
                        }
                    ]
                },
                {
                    "id": "8665",
                    "name": "新   疆",
                    "city": [
                        {
                            "id": "866501",
                            "name": "乌鲁木齐市"
                        },
                        {
                            "id": "866502",
                            "name": "克拉玛依市"
                        },
                        {
                            "id": "866521",
                            "name": "吐鲁番地区"
                        },
                        {
                            "id": "866522",
                            "name": "哈密地区"
                        },
                        {
                            "id": "866523",
                            "name": "昌吉回族自治州"
                        },
                        {
                            "id": "866527",
                            "name": "博尔塔拉蒙古自治州"
                        },
                        {
                            "id": "866528",
                            "name": "巴音郭楞蒙古自治州"
                        },
                        {
                            "id": "866529",
                            "name": "阿克苏地区"
                        },
                        {
                            "id": "866530",
                            "name": "克孜勒苏柯尔克孜自治州"
                        },
                        {
                            "id": "866531",
                            "name": "喀什地区"
                        },
                        {
                            "id": "866532",
                            "name": "和田地区"
                        },
                        {
                            "id": "866540",
                            "name": "伊犁哈萨克自治州"
                        },
                        {
                            "id": "866542",
                            "name": "塔城地区"
                        },
                        {
                            "id": "866543",
                            "name": "阿勒泰地区"
                        },
                        {
                            "id": "866590",
                            "name": "省直辖行政单位"
                        }
                    ]
                },
                {
                    "id": "8671",
                    "name": "台湾省",
                    "city": []
                },
                {
                    "id": "8681",
                    "name": "香  港",
                    "city": []
                },
                {
                    "id": "8682",
                    "name": "澳  门",
                    "city": []
                }
            ]
        },
        "01": {
            "id": "01",
            "name": "美国",
            "province": [
                {
                    "id": "0101",
                    "name": "纽约州",
                    "city": []
                },
                {
                    "id": "0102",
                    "name": "夏威夷州",
                    "city": []
                },
                {
                    "id": "0103",
                    "name": "衣阿华州",
                    "city": []
                },
                {
                    "id": "0104",
                    "name": "伊利诺州",
                    "city": []
                },
                {
                    "id": "0105",
                    "name": "堪萨斯州",
                    "city": []
                },
                {
                    "id": "0106",
                    "name": "麻萨诸塞州",
                    "city": []
                },
                {
                    "id": "0107",
                    "name": "阿拉巴马州",
                    "city": []
                },
                {
                    "id": "0108",
                    "name": "科罗拉多州",
                    "city": []
                },
                {
                    "id": "0109",
                    "name": "蒙他拿州",
                    "city": []
                },
                {
                    "id": "0110",
                    "name": "新墨西哥州",
                    "city": []
                },
                {
                    "id": "0111",
                    "name": "俄克拉荷马州",
                    "city": []
                },
                {
                    "id": "0112",
                    "name": "南达科他州",
                    "city": []
                },
                {
                    "id": "0113",
                    "name": "弗吉尼亚州",
                    "city": []
                },
                {
                    "id": "0114",
                    "name": "乔治亚州",
                    "city": []
                },
                {
                    "id": "0115",
                    "name": "德拉华州",
                    "city": []
                },
                {
                    "id": "0116",
                    "name": "爱达荷州",
                    "city": []
                },
                {
                    "id": "0117",
                    "name": "肯塔基州",
                    "city": []
                },
                {
                    "id": "0118",
                    "name": "密执安州",
                    "city": []
                },
                {
                    "id": "0119",
                    "name": "内华达州",
                    "city": []
                },
                {
                    "id": "0120",
                    "name": "北卡罗来纳州",
                    "city": []
                },
                {
                    "id": "0121",
                    "name": "内布拉斯加州",
                    "city": []
                },
                {
                    "id": "0122",
                    "name": "阿拉斯加州",
                    "city": []
                },
                {
                    "id": "0123",
                    "name": "加利福尼亚州",
                    "city": []
                },
                {
                    "id": "0124",
                    "name": "俄勒冈州",
                    "city": []
                },
                {
                    "id": "0125",
                    "name": "田纳西州",
                    "city": []
                },
                {
                    "id": "0126",
                    "name": "华盛顿州",
                    "city": []
                },
                {
                    "id": "0127",
                    "name": "印地安那州",
                    "city": []
                },
                {
                    "id": "0128",
                    "name": "缅因州",
                    "city": []
                },
                {
                    "id": "0129",
                    "name": "密西西比州",
                    "city": []
                },
                {
                    "id": "0130",
                    "name": "新罕布什尔州",
                    "city": []
                },
                {
                    "id": "0131",
                    "name": "路易斯安那州",
                    "city": []
                },
                {
                    "id": "0132",
                    "name": "明尼苏达州",
                    "city": []
                },
                {
                    "id": "0133",
                    "name": "俄亥俄州",
                    "city": []
                },
                {
                    "id": "0134",
                    "name": "亚利桑那州",
                    "city": []
                },
                {
                    "id": "0135",
                    "name": "康涅狄格州",
                    "city": []
                },
                {
                    "id": "0136",
                    "name": "宾夕法尼亚州",
                    "city": []
                },
                {
                    "id": "0137",
                    "name": "德克萨斯州",
                    "city": []
                },
                {
                    "id": "0138",
                    "name": "西弗吉尼亚州",
                    "city": []
                },
                {
                    "id": "0139",
                    "name": "佛罗里达州",
                    "city": []
                },
                {
                    "id": "0140",
                    "name": "马里兰州",
                    "city": []
                },
                {
                    "id": "0141",
                    "name": "密苏里州",
                    "city": []
                },
                {
                    "id": "0142",
                    "name": "新泽西州",
                    "city": []
                },
                {
                    "id": "0143",
                    "name": "南卡罗来纳州",
                    "city": []
                },
                {
                    "id": "0144",
                    "name": "佛蒙特州",
                    "city": []
                },
                {
                    "id": "0145",
                    "name": "阿肯色州",
                    "city": []
                },
                {
                    "id": "0146",
                    "name": "罗得岛州",
                    "city": []
                },
                {
                    "id": "0147",
                    "name": "北达科他州",
                    "city": []
                },
                {
                    "id": "0148",
                    "name": "犹他州",
                    "city": []
                },
                {
                    "id": "0149",
                    "name": "怀俄明州",
                    "city": []
                },
                {
                    "id": "0150",
                    "name": "威斯康星州",
                    "city": []
                }
            ]
        },
        "02": {
            "id": "02",
            "name": "英国",
            "province": [
                {
                    "id": "0201",
                    "name": "伦敦",
                    "city": []
                },
                {
                    "id": "0202",
                    "name": "其他地区",
                    "city": []
                }
            ]
        }

}